tutorials/monaLisa/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam);

beam
{
    pathName            mona2_path_A_OF.txt;    

    absorptionModel     constant;
    
    constantCoeffs
    {
        eta             0.9;
    }
    
    heatSourceModel     superGaussian;
    
    superGaussianCoeffs
    {
        k               2.0;
        dimensions      (100.0e-6 100.0e-6 30e-6);
    }
}

refinementControl
{
    refine                  true;
    
    nLevels                 4;
    
    refinementTemperature   1500;
        
    refinementController    ROAMR;
    
    ROAMRCoeffs
    {
        cellsPerProc        10000;
    }
}

// ************************************************************************* //
