tutorials/monaLisa/system/ExaCA
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

ExaCA
{
    type ExaCA;
    libs ("libExaCAFunctionObject.so");
}

// *********************************************************************** //
